Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Данные.ДействуетНаОсновании) Тогда
		Представление = СтрШаблон("%1 (на осн. %2)", Данные.Наименование, Данные.ДействуетНаОсновании);
	Иначе
		Представление = СтрШаблон("%1", Данные.Наименование);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ДействуетНаОсновании");
	Поля.Добавить("Наименование");
	
	
КонецПроцедуры